BOS.Integration.Azure.Microservices/BOS.Integration.Azure.Microservices.Services/NavXmlTemplates/UpdateSkuBody.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ean="urn:microsoft-dynamics-schemas/page/eannoupdate">
    <soapenv:Header/>
    <soapenv:Body>
        <ean:Update>
        <ean:EanNoUpdate>
            <ean:Key>{0}</ean:Key>
            <ean:EANNo>{1}</ean:EANNo>
            <ean:PrimeCargoProductId>{2}</ean:PrimeCargoProductId>
        </ean:EanNoUpdate>
        </ean:Update>
    </soapenv:Body>
</soapenv:Envelope>